Autodesk.Revit.DB.ConnectorGenderType
Connector gender type enum
Enum of connector gender type

Autodesk.Revit.DB.ConnectorGenderType.Female
Female connector gender type

Autodesk.Revit.DB.ConnectorGenderType.Male
Male connector gender type

Autodesk.Revit.DB.ConnectorGenderType.Undefined
Undefined connector gender type